export const initialIdioms = [
  {
    "id": 1,
    "word": "凤毛麟角",
    "meaning": "意思是凤凰的羽毛，麒麟的角。比喻珍贵而稀少的人或物。含褒义。",
    "color": "褒义",
    "frequency": 5
  },
  {
    "id": 2,
    "word": "方兴未艾",
    "meaning": "意思是事物正在发展，尚未达到止境。方：正在，兴：兴起；艾：停止。",
    "color": "中性",
    "frequency": 5
  },
  {
    "id": 3,
    "word": "潜移默化",
    "meaning": "意思是指人的思想或性格不知不觉受到感染、影响而发生了变化。",
    "color": "中性",
    "frequency": 4
  },
  {
    "id": 4,
    "word": "如出一辙",
    "meaning": "比喻两件事情非常相似。用于言论和行动等。",
    "color": "中性",
    "frequency": 4
  },
  {
    "id": 5,
    "word": "背道而驰",
    "meaning": "意思是比喻方向和目的完全相反。",
    "color": "中性",
    "frequency": 4
  },
  {
    "id": 6,
    "word": "人云亦云",
    "meaning": "指没有主见，只会随声附和。",
    "color": "中性",
    "frequency": 4
  },
  {
    "id": 9,
    "word": "毋庸置疑",
    "meaning": "实明显或理由充分，根本就没有怀疑的余地。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 10,
    "word": "昭然若揭",
    "meaning": "形容真相完全暴露出来。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 12,
    "word": "无孔不入",
    "meaning": "有空子就钻。比喻利用一切机会进行活动（含贬义）．",
    "color": "贬义",
    "frequency": 3
  },
  {
    "id": 13,
    "word": "相形见细",
    "meaning": "意为和同类的事物相比较显得不足。形：对照，细：不够．",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 14,
    "word": "无与伦比",
    "meaning": "意思是指事物非常完美，没有能够与它相比的同类的东西。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 16,
    "word": "浮光掠影",
    "meaning": "意思是水而上的反光和一闪而过的影子．比喻观察不细致，没有深的印象，又指文章言论的肤浅，无真知实学。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 17,
    "word": "理所当然",
    "meaning": "意思是道理当然是这样的意为情理之中发生的合乎情理的，不容怀疑。含褒义。",
    "color": "褒义",
    "frequency": 3
  },
  {
    "id": 18,
    "word": "一脉相承",
    "meaning": "意思是从同一血统、派别世代相承流传下来。比喻某种思想、行为或学说之间有继承关系。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 19,
    "word": "大同小异",
    "meaning": "意思是指大体相同略有差异。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 20,
    "word": "数不胜数",
    "meaning": "意思是数都数不过来。形容数量极多，很难计算。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 21,
    "word": "相去甚远",
    "meaning": "指互相之间存在很大差异和距离。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 23,
    "word": "熙熙攘攘",
    "meaning": "形容人来人往，非常热闹拥挤．",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 24,
    "word": "泥沙俱下",
    "meaning": "指在江河的急流中泥土和沙子随着水一起冲下．比喻好坏性质不同的人或者事物混杂在一起。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 25,
    "word": "人声鼎沸",
    "meaning": "本意是锅里的水烧开了，发出响声，现指人群的声音吵吵嚷嚷，就像炸开了",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 27,
    "word": "良秀不齐",
    "meaning": "意思是指好人坏人都有，混杂在一起。现在可以指好的坏的事物混杂在一起。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 28,
    "word": "不计其数",
    "meaning": "释义是没办法计算数目，形容极多。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 29,
    "word": "过犹不及",
    "meaning": "意思是事情做得过头，就跟做得不够一样，都是不合适的．",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 30,
    "word": "积重难返",
    "meaning": "意思是指长期形成的不良的风俗、习惯不易改变。也指长期积累的问题不易解决。含贬义。",
    "color": "贬义",
    "frequency": 3
  },
  {
    "id": 31,
    "word": "得不偿失",
    "meaning": "意思是所得的利益抵偿不了所受的损失。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 34,
    "word": "无可厚非",
    "meaning": "不可过分指责，表示虽有缺点，但是可以理解或原谅。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 35,
    "word": "异军突起",
    "meaning": "意思是比喻与众不同的新派别或新力量一下子崛起。含褒义。",
    "color": "褒义",
    "frequency": 3
  },
  {
    "id": 36,
    "word": "不胜枚举",
    "meaning": "意思是指无法一一全举出来，形容数量很多。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 37,
    "word": "源远流长",
    "meaning": "意思是河流的源头很远水流很长．常比喻历史悠久，根底深厚．含褒义。",
    "color": "褒义",
    "frequency": 3
  },
  {
    "id": 38,
    "word": "寥寥无几",
    "meaning": "意思是形容稀少，没有几个。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 39,
    "word": "鱼目混珠",
    "meaning": "意思是指拿鱼眼睛冒充珍珠，比喻用假的冒充真的．含贬义。",
    "color": "贬义",
    "frequency": 3
  },
  {
    "id": 40,
    "word": "按部就班",
    "meaning": "意思是按照一定的步骤、顺序进行。也指按老规矩办事，缺乏创新精神。部、班：门类，次序就：归于。免费公考学习千货公众号樱有尽有。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 41,
    "word": "急于求成",
    "meaning": "形容急着要取得成功。含贬义。",
    "color": "贬义",
    "frequency": 3
  },
  {
    "id": 42,
    "word": "巧夺天工",
    "meaning": "专指精巧的人工胜过天然，形容技艺极其精巧。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 43,
    "word": "只言片语",
    "meaning": "个别词句，片段的话语．指很少的话。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 45,
    "word": "汗牛充栋",
    "meaning": "指用牛运书牛要累得出汗，用屋子放书，要放满整个屋子．形容藏书很多。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 47,
    "word": "举一反三",
    "meaning": "意思是从懂得的一点，类推而知道其它的。含褒义。",
    "color": "褒义",
    "frequency": 3
  },
  {
    "id": 48,
    "word": "历久弥新",
    "meaning": "指经历长久的时间而更加鲜活，更加有活力，更显价值。或者是指一样东西不因时间而变旧，变腐，反而更加有活力，更显价值，比新的还要好。弥：更加。",
    "color": "中性",
    "frequency": 3
  },
  {
    "id": 50,
    "word": "无可非议",
    "meaning": "意思是没有什么可以指责的表示言行合乎情理．可用来形容人、事、思想、行动、品质等。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 51,
    "word": "天马行空",
    "meaning": "意思是天马奔驰神速，像是腾起在空中飞行一样。多比喻诗文气势豪放，不受拘束。多比喻人浮躁；不踏实。也有说明不切实际之意。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 53,
    "word": "来势汹汹",
    "meaning": "意思是动作或事物到来的气势很厉害。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 55,
    "word": "条分缕析",
    "meaning": "一条一缕地分析。形容分析得细密清楚而有条理。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 56,
    "word": "左支右细",
    "meaning": "指力量不足，应付了这一方面，那一方面又有了问题．",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 57,
    "word": "独木难支",
    "meaning": "意思是一根木头支持不住高大的房子，比喻一个人的力量难以支撑全局。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 58,
    "word": "捉襟见肘",
    "meaning": "意思是拉一下衣襟就露出胳膊肘儿，形容衣服破烂．比喻顾此失彼，穷于应付．",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 59,
    "word": "矫枉过正",
    "meaning": "把弯曲的东西扭直，结果过了头，又歪向另一方。比喻纠正错误超过了应有的限度。矫：纠正。枉：弯曲。过正：过了头，超过了应有的限度。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 60,
    "word": "近在朋尺",
    "meaning": "形容距离很近。朋(zh r)\t:古代长度名。周制八寸，合现在市尺六寸二分二厘。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 61,
    "word": "不言而喻喻",
    "meaning": "了解，明白。不用说话就能明白。形容道理很明显。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 62,
    "word": "街谈巷议",
    "meaning": "大街小巷里人们的议论。指民间的舆论。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 63,
    "word": "一马当先",
    "meaning": "原指作战时策马冲锋在前。形容领先。也比喻工作走在群众前而，积极带头。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 64,
    "word": "根治病灶",
    "meaning": "彻底治疗由病原微生物病变引起的疾病。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 65,
    "word": "爱莫能助",
    "meaning": "指有心帮助，但因力量不够或条件所限而做不到。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 66,
    "word": "大放异彩",
    "meaning": "闪耀着无比灿烂的光辉，散发出奇异的光彩或色彩。比喻有着优异的表现或是突出的成就。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 67,
    "word": "恍如隔世",
    "meaning": "仿佛隔了一世。多感慨因人事变迁很大而感到一切都陌生了．",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 68,
    "word": "如日中天",
    "meaning": "好像中午时的太阳。比喻事物正在最兴盛的时候。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 69,
    "word": "标新立异",
    "meaning": "能独创新意，立论与其他人不同．后多指提出新的见解。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 71,
    "word": "手足无措",
    "meaning": "形容举动慌乱或没有办法应付．",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 72,
    "word": "模棱两可",
    "meaning": "对问题或事物正反两方面，持既不肯定、也不否定的态度。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 73,
    "word": "熘烟生辉",
    "meaning": "形容光彩闪耀的样子烟烟，闪烁的样子。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 74,
    "word": "赏心悦目",
    "meaning": "悦目：看了舒服．指看到美好的景色而心情愉快。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 75,
    "word": "喜闻乐见",
    "meaning": "意思是喜欢听，乐意看。形容很受欢迎。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 76,
    "word": "难能可贵",
    "meaning": "意思是做到了难做之事，十分可贵。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 77,
    "word": "毋庸讳言",
    "meaning": "意思是指用不着隐讳，可以直说的内容．毋庸指不用．",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 78,
    "word": "津津乐道",
    "meaning": "意思是很有兴趣地说个不停。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 79,
    "word": "前所未有",
    "meaning": "历史上从来没有过。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 80,
    "word": "出类拔萃",
    "meaning": "指超出一般（多用于形容品德、才能）。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 83,
    "word": "势如破竹",
    "meaning": "形容作战或工作节节胜利，毫无阻碍。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 84,
    "word": "触手可及",
    "meaning": "指近在手边一伸手就可以接触到。形容距离极近。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 85,
    "word": "脱颖而出",
    "meaning": "意思是才华像禾穗的尖芒那样，整个锋芒都会挺露出来．含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 86,
    "word": "走马观花",
    "meaning": "意思是指骑在奔跑的马上看花。原形容事情如意，心情愉快．后多指粗略地观察一下．含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 87,
    "word": "蜡蜓点水",
    "meaning": "意思是指靖蜓在水面飞行时用尾部轻触水面的动作。比喻做事肤浅不深入，也形容轻轻一吻。含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 88,
    "word": "相提并论",
    "meaning": "不同的人或事物不加区别地混在一起来谈论或者看待。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 89,
    "word": "登峰造极",
    "meaning": "意思是登上顶峰，指到达最高点比喻学问、技艺等已达到最高的境界。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 90,
    "word": "缘木求鱼",
    "meaning": "字面解读为爬到树上去找鱼。比喻方向或办法不对，不可能达到目的．含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 91,
    "word": "一日千里",
    "meaning": "原形容马跑得很快。后比喻进展极快。含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 92,
    "word": "相映成趣",
    "meaning": "意思是相互衬托着，显得很有趣味，很有意思。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 94,
    "word": "登堂入室",
    "meaning": "意思是登上厅堂，进入内室。比喻学问或技能从浅到深，达到很高的水平。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 95,
    "word": "经天纬地",
    "meaning": "意思是形容有治理天下才能的经世之才．含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 96,
    "word": "连绵不断",
    "meaning": "连续不断的样子．形容连续不止，一直都不中断。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 97,
    "word": "毫无二致",
    "meaning": "意思是丝毫没有什么两样，指完全一样。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 98,
    "word": "各有千秋",
    "meaning": "意思是各有各的存在的价值。比喻在同一层次内各人有各人的长处，各人有各人的特色。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 99,
    "word": "烟消云散",
    "meaning": "像烟云消散一样。比喻事物消失得千干净净。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 100,
    "word": "稍纵即逝",
    "meaning": "意思是稍微一放松就消失了。形容时间或机会等很容易过去。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 101,
    "word": "昙花一现",
    "meaning": "意思是比喻美好的事物或景象出现了一下，很快就消失。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 102,
    "word": "变幻莫测",
    "meaning": "解释是指事物变化很多不能预料，变化多端，难以揣测。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 103,
    "word": "斗转星移",
    "meaning": "意思是星斗变动位置，指季节或时间的变化。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 104,
    "word": "鬼斧神工",
    "meaning": "原义是像是鬼神制作出来的。形容艺术技巧高超，不像是人力所能达到的。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 105,
    "word": "五彩续纷",
    "meaning": "表示颜色繁多，色彩绚丽十分好看的样子。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 108,
    "word": "异曲同工",
    "meaning": "比喻不同时代、不同人的文章、言论一样精彩，或不同的事情产生相同的效果，原意为不同的曲子有着相同的影响，同样精彩。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 109,
    "word": "屈指可数",
    "meaning": "意思是扳着手指就可以数清楚，形容数量稀少。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 112,
    "word": "崭露头角",
    "meaning": "比喻突出地显露出才能和本领（多指青少年）。含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 113,
    "word": "截然不同",
    "meaning": "意思是事物之间界限分明，全然不一样。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 114,
    "word": "千方百计",
    "meaning": "想尽种种办法；用出种种计谋。含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 115,
    "word": "独树一帜",
    "meaning": "比喻与众不同自成一家。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 116,
    "word": "突飞猛进",
    "meaning": "形容进步和发展特别迅速。突、猛：形容急速。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 117,
    "word": "激浊扬清",
    "meaning": "本意为冲去污水，让清水上来。比喻拌击坏人坏事，褒扬好人好事。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 118,
    "word": "拨云见日",
    "meaning": "比喻冲破黑暗见到光明。也比喻疑团消除，心里顿时明白。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 119,
    "word": "水涨船高",
    "meaning": "意思是水位升高，船身也随之浮起。比喻事物随着它所凭借的基础的提高而增长提高。免费公考资料公众号樱有尽有。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 123,
    "word": "酸瑚灌顶",
    "meaning": "即将牛奶中精炼出来的乳酪浇到头上，佛家以此比喻灌输智慧，使人得到启发，彻底醒悟，也比喻听了高明的意见使人受到很大启发。也形容清凉舒适，含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 124,
    "word": "举足轻重",
    "meaning": "意思是只要脚稍微移动一下，就会影响两边的轻重。指处于重要地位，一举一动都足以影响全局。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 125,
    "word": "一知半解",
    "meaning": "意思是指知道得不全面，理解得也不透彻。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 126,
    "word": "不求甚解",
    "meaning": "意思是只求知道个大概，不求彻底了解。常指学习或研究不认真、不深入。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 127,
    "word": "俯拾皆是",
    "meaning": "意思是只要低下头来捡取，到处都是，形容多而易得。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 129,
    "word": "事与愿违",
    "meaning": "意思是事情的发展与愿望相反，指事情没能按照预想的方向发展。含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 130,
    "word": "欲速不达",
    "meaning": "意思是想求快速，反而不能达到目的。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 131,
    "word": "作茧自缚",
    "meaning": "意思是春蚕吐丝为茧，将自己裹缚其中。比喻弄巧成拙自作自受。含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 132,
    "word": "风起云涌",
    "meaning": "形容雄浑磅瑚之势，也比喻事物迅速发展，声势浩大，含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 134,
    "word": "无足轻重",
    "meaning": "意思是没有它并不轻些，有它也并不重些。指无关紧要。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 135,
    "word": "口若悬河",
    "meaning": "意思是讲起话来滔滔不绝，像瀑布不停地奔流倾泻．形容能说会辩，说起来没个完．含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 136,
    "word": "恰如其分",
    "meaning": "一指说话办事不过分；二指办事或说话十分恰当合适。含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 137,
    "word": "扬汤止沸",
    "meaning": "意思是把锅里开着的水吕起来再倒回去，使它凉下来不沸腾．比喻办法不彻底，不能从根本上解决问题。含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 138,
    "word": "和风细雨",
    "meaning": "意思是比喻耐心地和颜说色地批评或劝说。含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 139,
    "word": "千篇一律",
    "meaning": "原指一千篇文章都一个样，现指文章公式化；比喻办事按一个格式，非常机械泛指事物形式陈旧呆板、呆滞。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 140,
    "word": "深入人心",
    "meaning": "意思是指理论、学说、政策等为人们深切了解和信服。含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 141,
    "word": "经久不衰",
    "meaning": "意思是精神饱满的状态，身体健壮的外表形容某事或某人经历很长时间仍旧保持较高的旺盛状态。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 142,
    "word": "深入浅出",
    "meaning": "指言论或文章的观点主题意义深刻但在语言文字的表达方式上却浅显易懂．",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 143,
    "word": "委曲求全",
    "meaning": "意思是勉强迁就，以求保全。也指为了顾全大局而让步。含褒义。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 144,
    "word": "虚与委蛇",
    "meaning": "意思是指对人虚情假意，敷衍应酬．含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 145,
    "word": "沽名钓誉",
    "meaning": "使用各种不正当手段以谋取好的名声和荣誉。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 147,
    "word": "裨官野史",
    "meaning": "泛称小说及记载不见经传的软闻琐事的著述。旧时小说、杂史的统称。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 148,
    "word": "滥竿充数",
    "meaning": "意思是不会吹竿的人混在会吹竿的队伍里充数。比喻无本领的冒充有本领，次货冒充好货。含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 149,
    "word": "鱼龙混杂",
    "meaning": "意思是形容好人和坏人混在一起。含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 150,
    "word": "此起彼伏",
    "meaning": "意思是这里起来，那里下去；形容接连不断。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 151,
    "word": "层出不穷",
    "meaning": "比喻事物或言论接连不断地出现，尚未穷尽．层：重复，接连不断，穷：尽，完，完全。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 152,
    "word": "安身立命",
    "meaning": "意思是生活有着落．含褒义．",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 153,
    "word": "兴旺发达",
    "meaning": "意思是指事物或事业充分发展、欣欣向荣的景象。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 154,
    "word": "循规蹈矩",
    "meaning": "原指遴守规矩。现多指拘泥于旧准则，不敢稍做变通。指没有创新。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 155,
    "word": "分庭抗礼",
    "meaning": "意思是指比喻双方平起平坐，地位相等、实力相当可以抗衡。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 156,
    "word": "炉火纯青",
    "meaning": "意思是认为炼到炉里发出纯青色的火焰就算成功了，后用来比喻功夫达到了纯熟完美的境界。指学问、技术等．",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 157,
    "word": "细枝末节",
    "meaning": "比喻事情或问题的细小而无关紧要的部分。含贬义。",
    "color": "贬义",
    "frequency": 2
  },
  {
    "id": 158,
    "word": "此消彼长",
    "meaning": "是指这个下降，那个上升。引申为不要太过于在乎此时的失去，别的方面会有长进。什么事情都有两面或者多面性。或者引申为两个事物之间的反相关关系。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 159,
    "word": "融会贯通",
    "meaning": "意思是指各方面的知识或道理融合贯穿起来，从而得到系统透彻的理解．融会：融合领会；贯通透彻理解。含褒义，多用在学习上。",
    "color": "褒义",
    "frequency": 2
  },
  {
    "id": 160,
    "word": "耳熟能详",
    "meaning": "指听得多了，能够很清楚、很详细地复述出来。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 161,
    "word": "日新月异",
    "meaning": "意思是每天都在更新，每月都有变化，指发展或进步迅速，不断出现新事物、新气象。",
    "color": "中性",
    "frequency": 2
  },
  {
    "id": 162,
    "word": "深恶痛绝",
    "meaning": "指对某人或对某事物厌恶、痛恨到极点。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 163,
    "word": "退避三舍",
    "meaning": "意思是主动退让九十里．比喻退让和回避，避免冲突。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 164,
    "word": "望而生畏",
    "meaning": "意思是一见之下就产生了畏惧心理。形容人态度威严或事务艰难令人畏惧．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 165,
    "word": "敬而远之",
    "meaning": "表示尊敬却有所顾虑不愿接近。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 166,
    "word": "荒腔走板",
    "meaning": "原意是指演员唱曲音调不准、不和板眼，现多用来比喻说话离题或举动超出适当尺度。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 167,
    "word": "颜面尽失",
    "meaning": "丢面子、脸面全丢了。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 168,
    "word": "人尽皆知",
    "meaning": "意思是全部的人都知道，比喻一件事流传很广泛。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 169,
    "word": "哗众取宠",
    "meaning": "意思是以浮夸的言行迎合群众，骗取群众的信赖和支持。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 170,
    "word": "接二连三",
    "meaning": "意思是一个接着一个，接连不断。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 171,
    "word": "薪火相传",
    "meaning": "比喻学问和技艺代代相传。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 172,
    "word": "安居乐业",
    "meaning": "意思指人民生活安定美满的样子比喻安定地生活，愉快地工作，形容管理者把社会治理得很好．含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 173,
    "word": "海晏河清",
    "meaning": "意思是比喻天下太平．晏平静．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 175,
    "word": "钟灵毓秀",
    "meaning": "意思是疑聚了天地间的灵气孕育着优秀的人物。指山川秀美人才辈出。钟：聚集；毓：孕育。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 176,
    "word": "瑕瑜互见",
    "meaning": "意思是比喻有缺点也有优点表示客观的评价，比喻优点、缺点都有。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 177,
    "word": "春秋笔法",
    "meaning": "意思是指寓褒贬千曲折的文笔之中。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 178,
    "word": "弹冠相庆",
    "meaning": "意思是比喻一个人做了官或升了官，他的同伙因此将得到援引有官可做，也互相祝贺。后用来形容坏人得意。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 179,
    "word": "言外之意",
    "meaning": "意思是指有这个意思，但没有在话里明说出来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 180,
    "word": "低头折节",
    "meaning": "意思是丧失气节，屈服于他人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 182,
    "word": "额手称庆",
    "meaning": "意思是双手合掌，举到额头，表示感到庆幸。形容令人称快的事情额手：以手加额。把手放在额上。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 183,
    "word": "微言大义",
    "meaning": "意思是包含在精微语言里的深刻的道理．微言：精当而含义深远的话，大义：本指经书的要义，后指大道理。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 184,
    "word": "击节赞叹",
    "meaning": "指打着拍子欣赏诗文或艺术作品。形容对人的行为、言论、诗文、技艺等十分赞赏。节，节拍击节，打拍子，叹赏，赞叹赏识。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 185,
    "word": "投闲置散",
    "meaning": "指不被重视或不被任用．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 186,
    "word": "循序渐进",
    "meaning": "意思是按一定的顺序、步骤逐渐进步．含褒义，用于学习或工作。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 187,
    "word": "贪大求快",
    "meaning": "过分地贪图规模大而全面。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 188,
    "word": "按图索骥",
    "meaning": "指按照图像寻找好马，比喻按线索寻找，也比喻办事机械、死板。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 189,
    "word": "别有匠心",
    "meaning": "构思巧妙，与众不同．别：独特的，匠心：巧妙的心思。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 190,
    "word": "入室升堂",
    "meaning": "意思是人的学识技艺等方面有高深的造诣．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 191,
    "word": "冰山一角",
    "meaning": "一般指非常大的事物只显露出很小的一部分。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 194,
    "word": "保驾护航",
    "meaning": "保护某事物能让其能正常发展。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 195,
    "word": "披荆斩棘",
    "meaning": "意思是指拨开荆，砍掉棘，比喻在前进道路上清除障碍，克服困难。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 196,
    "word": "添砖加瓦",
    "meaning": "原来指建房屋时给不断地添砖块加瓦片。后比喻做一些工作，尽一点力量。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 197,
    "word": "弱肉强食",
    "meaning": "原指动物中弱者被强者吞食，比喻弱的被强的吞并．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 198,
    "word": "优胜劣汰",
    "meaning": "指生物在生存竞争中适应力强的保存下来，适应力差的被淘汰。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 199,
    "word": "物竞天择",
    "meaning": "原指生物进化的一般规律，后也用于人类社会的发展。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 200,
    "word": "恒河沙数",
    "meaning": "意思是像恒河里的沙粒一样，无法计算。形容数量很多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 204,
    "word": "见微知著",
    "meaning": "指见到事情的苗头，就能知道它的实质和发展趋势．比喻小中见大、以小见大。微：隐约著：明显。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 205,
    "word": "建言献策",
    "meaning": "陈述主张或意见，通过口头或文章提出的有益的意见，出谋划策，进献计策。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 206,
    "word": "出谋划策",
    "meaning": "意思是制定计谋策略。多指为人出主意。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 207,
    "word": "老生常谈",
    "meaning": "意思是老书生经常说的话，比喻人们听惯了的没有新鲜意思的话。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 208,
    "word": "烂熟于心",
    "meaning": "指已记得滚瓜烂熟了。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 209,
    "word": "陈词滥调",
    "meaning": "形容语言陈腐、空泛．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 210,
    "word": "轻车熟路",
    "meaning": "意思是赶着装载很轻的车子走熟悉的路，比喻事情又熟悉又容易。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 211,
    "word": "流口常谈",
    "meaning": "意思是人人挂在嘴上的老话。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 212,
    "word": "毫不例外",
    "meaning": "一点都不例外，不搞特别不搞特殊．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 213,
    "word": "无一例外",
    "meaning": "指都是这样，没有其他特殊的．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 214,
    "word": "无一幸免",
    "meaning": "没有一个人能逃脱（灾难），数量上指全部。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 215,
    "word": "不出所料",
    "meaning": "意思是指事由变化，在预料之中，形容原先预料的准确。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 216,
    "word": "逸闻",
    "meaning": "事：意思是指流传在外不见记载的事迹。用于书面语。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 217,
    "word": "龙蛇混杂",
    "meaning": "比喻好人和坏人混在一起。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 218,
    "word": "胡编乱造",
    "meaning": "意思指没有根据、不合情理地胡乱编造。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 219,
    "word": "炙手可热",
    "meaning": "意思是手一靠近就感觉很烫，比喻气焰盛、权势大，使人不敢靠近。炙：烤．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 220,
    "word": "大行其道",
    "meaning": "意思是指在某范围内广为流传，盛行一时。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 222,
    "word": "一成不变",
    "meaning": "指一经形成，不再改变。亦泛指墨守成规，不知变通。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 223,
    "word": "根深蒂固",
    "meaning": "比喻基础稳固，不容易动摇。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 224,
    "word": "少之又少",
    "meaning": "很少很少，几乎没有的意思。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 225,
    "word": "大道至简",
    "meaning": "意思是大道理（基本原理、方法和规律）是极其简单的，简单到一两句话就能说明白。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 226,
    "word": "前仆后继",
    "meaning": "意思是指前面的人倒下了，后面的人继续跟上去。英勇斗争，不怕牺牲。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 227,
    "word": "通俗易懂",
    "meaning": "意思为广大人民群众都能懂得。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 228,
    "word": "不温不火",
    "meaning": "意思是不冷淡也不火爆，形容平淡适中。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 230,
    "word": "后继无人",
    "meaning": "意思是没有后人来继承前人的事业。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 231,
    "word": "粉墨登场",
    "meaning": "原指演员化妆上台演戏。现比喻坏人经过一番打扮，登上政治舞台。含贬义，表讥讽．",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 232,
    "word": "拔地而起",
    "meaning": "指山峰、植物、建筑物等高耸在地面上．形容从地面上突兀而起，非常陡峭、",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 233,
    "word": "横空出世",
    "meaning": "意思是形容人或物高大，横在空中，浮出人世，或比喻卓尔不群。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 234,
    "word": "破土而出",
    "meaning": "从土里冒出来。比喻在重重压力下显露头角。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 235,
    "word": "曲意逢迎",
    "meaning": "意思是违背自己的本心去迎合别人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 236,
    "word": "心口不一",
    "meaning": "意思是心里想的和嘴上说的不一样。形容人的虚伪、诡诈，含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 237,
    "word": "不切实际",
    "meaning": "意思是指不符合实际，用于虚幻的想法。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 239,
    "word": "阿谀奉承",
    "meaning": "意为迎合别人，竭力向人讨好。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 240,
    "word": "独善其身",
    "meaning": "意思是原指独自修养身心，保待个人的节操，后指只顾自己不管他人的个人主义处事哲学。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 241,
    "word": "好大喜功",
    "meaning": "指不管条件是否许可，一心想做大事立大功。多用以形容浮夸的作风，含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 242,
    "word": "投其所好",
    "meaning": "意思是迎合别人的喜好。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 243,
    "word": "明哲保身",
    "meaning": "原义是指明于事理的人善于自保，有褒义。现在则指为了保住个人利益回避原则斗争的庸俗作风有贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 246,
    "word": "广开言路",
    "meaning": "意思是指尽量给下面创造发表意见的条件。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 247,
    "word": "以理服人",
    "meaning": "用道理说服人，用道理使人信服。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 248,
    "word": "畅所欲言",
    "meaning": "尽情地说出想说的话，没有约束地把心里话吐露出来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 250,
    "word": "求同存异",
    "meaning": "意思是找出共同点，保留不同意见。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 251,
    "word": "集思广益",
    "meaning": "意思指集中群众的智慧，广泛吸收有益的意见。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 252,
    "word": "一针见血",
    "meaning": "意思是比喻说话直截了当切中要害。含褒义。多用于批评性意见或建议。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 254,
    "word": "鞭辟入里",
    "meaning": "形容做学问切实。今多形容说明问题透彻，切中要害。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 255,
    "word": "无关痛痒",
    "meaning": "意思指与自身利害没有关系或无足轻重。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 256,
    "word": "和颜悦色",
    "meaning": "意思是和蔼喜悦的神色；和蔼可亲的面色。形容态度温和亲切。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 257,
    "word": "隔靴播痒",
    "meaning": "意思是指隔着靴子挠痒痒。比喻说话写文章没有抓住主题和要点，不中肯，不贴切，或比喻做事没有抓住关键，不解决问题，徒劳无功。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 259,
    "word": "舌灿莲花",
    "meaning": "形容人口才好，口齿伶俐，能言善道，有如莲花般地美妙。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 260,
    "word": "闻一知十",
    "meaning": "意思是听到一点就能理解很多形容善于类推，含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 261,
    "word": "旁征博引",
    "meaning": "意思是指说话、写文章引用材料作为依据或例证。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 262,
    "word": "妙语连珠",
    "meaning": "意思是巧妙风趣的话一个接一个。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 263,
    "word": "声情并茂",
    "meaning": "指演唱、朗诵等的音色、唱腔和表达的感情都很动人，含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 265,
    "word": "兴师动众",
    "meaning": "意思是指大规模出兵。现多指动用很多人力做某件事，含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 266,
    "word": "劳民伤财",
    "meaning": "意思是既使人民劳苦，又耗费钱财，现也指滥用人力物力。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 267,
    "word": "繁文绵节",
    "meaning": "比喻过分繁琐的仪式或礼节。也比喻其他繁琐多余的事项。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 268,
    "word": "无可争议",
    "meaning": "指对一个问题的看法、观点或做法，没有其他不同的看法、观点可以辩论、争论和议论。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 269,
    "word": "大动干戈",
    "meaning": "意思是大规模地进行战争。比喻大张声势地行事。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 270,
    "word": "无可讳言",
    "meaning": "意思为没有什么不可以直说的，指可以坦率地说。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 273,
    "word": "避重就轻",
    "meaning": "指回避重的责任，只拣轻的来承担，也指回避主要的问题，只谈无关重要的方面。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 275,
    "word": "难以割舍",
    "meaning": "不愿意舍弃或丢开。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 276,
    "word": "与生俱来",
    "meaning": "表示个人的特别、不可替代性，一生下来就是如此。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 278,
    "word": "刻骨铭心",
    "meaning": "意思是铭刻在心灵深处；形容记忆深刻难以忘却．含褒义．",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 279,
    "word": "青黄不接",
    "meaning": "意思是指庄稼还没有成熟，陈粮已经吃完。也可比喻人力、财力等因一时接续不上而暂时缺乏．现在也用于人才方面后继无人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 280,
    "word": "撼夭震地",
    "meaning": "意思是指摇动了天，震撼了地。形容声势浩大，无坚不摧的力量。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 281,
    "word": "茫然不解",
    "meaning": "意思是一无所知不理解。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 282,
    "word": "知之甚少",
    "meaning": "对某方面知道的太少。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 283,
    "word": "沉思翰藻",
    "meaning": "寓意深刻文辞华丽。沉：深沉翰藻：文辞华丽。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 284,
    "word": "文采斐然",
    "meaning": "意思是指文章中表现出来的典雅艳丽和令人赏心悦目的色彩和风格，说一个人文采好。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 285,
    "word": "形神兼备",
    "meaning": "指书法和雕塑绘画作品不但有美妙的形态且有神韵．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 286,
    "word": "举不胜举",
    "meaning": "意思是列举也列举不完。形容数量很多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 287,
    "word": "缀玉联珠",
    "meaning": "比喻撰写美好的诗文。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 290,
    "word": "不负韶华",
    "meaning": "指不辜负美好的时光、美好的年华。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 291,
    "word": "无足挂齿",
    "meaning": "意思是哪里值得挂在嘴上，不值一提。足：值得；挂齿：提及，谈及。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 292,
    "word": "不负春光",
    "meaning": "不辜负春天的大好时光。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 293,
    "word": "无伤大雅",
    "meaning": "意思指虽有影响但对主要方面没有妨害。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 295,
    "word": "水丰草茂",
    "meaning": "指水流充沛，草儿茂盛。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 296,
    "word": "广袤无",
    "meaning": "形容广阔得望不到边际，辽阔无边。比喻非常广阔。广：东西的长度。袤：南北的长度．坻边际；边界。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 297,
    "word": "山高水长",
    "meaning": "像山一样高耸，如水一般长流．原比喻人的风范或声誉像高山一样永远存在。后比喻恩德深厚。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 299,
    "word": "天高地阔",
    "meaning": "天空高远大地辽阔形容空间很广阔",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 300,
    "word": "学思践悟",
    "meaning": "指学习再思考，再通过实践悟出道理。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 301,
    "word": "细照笃行",
    "meaning": "指将焦裕禄精神作为一面镜子从里到外、从上到下反复照一照，深入检查自已在思想境界、素质能力、作风形象等方面存在的问题和不足，从而不断提升自",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 302,
    "word": "知行合一",
    "meaning": "指的是思想与行动的高度统一．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 304,
    "word": "一无是处",
    "meaning": "比喻一个人或物没有一点用处．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 306,
    "word": "一无所知",
    "meaning": "意思是什么也不知道。指人见识少。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 307,
    "word": "参差不齐",
    "meaning": "原意是长短、高低、大小不一致，形容很不整齐或水平不一．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 308,
    "word": "众说纷纭",
    "meaning": "意思是人多嘴杂，各有各的说法，议论纷纷．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 309,
    "word": "热闹非凡",
    "meaning": "意思是形容热闹的场面或景象。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 310,
    "word": "破绽百出",
    "meaning": "意思是比喻说话做事  洞非常多．含贬义．",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 312,
    "word": "群雄逐鹿",
    "meaning": "形容各派势力争夺最高统治地位。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 313,
    "word": "齐头并进",
    "meaning": "意思是多方面同时前进。多形容几件事情或几项工作同时进行。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 314,
    "word": "唇齿相依",
    "meaning": "意思是嘴唇和牙齿互相依靠。比喻双方关系密切，相互依存。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 315,
    "word": "休戚与共",
    "meaning": "意思是有幸福共同亨受，有祸患共同抵挡。形容关系紧密，利害相同。休：喜悦．戚：悲伤．含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 316,
    "word": "同舟共济",
    "meaning": "本意是坐一条船，共同渡河。比喻团结互助，同心协力，战胜困难。也比喻利害相同．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 317,
    "word": "水乳交融",
    "meaning": "意思是像水和乳汁那样融合在一起，比喻关系非常融洽或结合得很紧密。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 318,
    "word": "遗文逸事",
    "meaning": "意思是前代或前人遗留下来而少为人知的传闻，多指不见于正式记载的。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 319,
    "word": "身临其境",
    "meaning": "意思指亲身面临那种境地也作身历其境。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 320,
    "word": "纷至沓来",
    "meaning": "意思是形容纷纷到来，连续不断地到来．多用于来指人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 321,
    "word": "设身处地",
    "meaning": "意思是设想自己处在别人的境地。指站在别人的处境替别人着想。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 322,
    "word": "想方设法",
    "meaning": "意思是想种种办法．含褒义．",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 323,
    "word": "噤若寒蝉",
    "meaning": "原指像冬季的蝉那样停止鸣叫．后比喻因害怕有所顾虑而不敢说话，含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 324,
    "word": "畏首畏尾",
    "meaning": "意思是前也怕，后也怕；比喻做事胆子小，顾虑多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 325,
    "word": "投鼠忌器",
    "meaning": "要打老鼠又怕打坏了它旁边的器物，比喻想打击坏人而又有所顾忌．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 326,
    "word": "谈虎色变",
    "meaning": "意思是比喻只要提到可怕的事情，紧张的连脸色都变了。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 327,
    "word": "如鱼得水",
    "meaning": "意思是好像鱼得到水一样．比喻得到跟自己十分投合的人或对自己很合适的环境。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 329,
    "word": "雨后春笋",
    "meaning": "意思是指春天下大雨后发出来的竹笋，而且一下子就长出来很多．比喻新生事物迅速大量地涌现出来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 330,
    "word": "毫不相干",
    "meaning": "指跟某个事物没有丝毫联系。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 332,
    "word": "悄然兴起",
    "meaning": "意思是不知不觉中，某样事物开始流行或兴盛起来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 333,
    "word": "心不在焉",
    "meaning": "意思是心思不在这里，指思想不集中．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 334,
    "word": "众口一词",
    "meaning": "意思是所有的人都说同样的话。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 335,
    "word": "味同嚼蜡",
    "meaning": "表面意思是像吃蜡一样，没有一点儿味。形容语言或文章枯燥无味。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 336,
    "word": "兴味索然",
    "meaning": "意思是一点儿兴趣都没有兴味：兴趣、趣味，索然：毫无兴致的样子．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 337,
    "word": "死而复生",
    "meaning": "意思是死去了又活过来，形容生命不息。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 338,
    "word": "柳暗花明",
    "meaning": "形容柳树成荫，繁花似锦的春天景象。也比喻在困难中遇到转机。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 339,
    "word": "重见天日",
    "meaning": "指重新看到了天和太阳。比喻脱离黑暗，重见光明。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 340,
    "word": "卷土重来",
    "meaning": "意思是指遭到失败以后再组织力矗．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 341,
    "word": "互为表里",
    "meaning": "意思是甲为乙的外表，乙为甲的内里；比喻互相依存，互相接受。主语必须是两个以上。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 342,
    "word": "互相标榜",
    "meaning": "意思是互相称颂，互相吹嘘多用贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 343,
    "word": "互为因果",
    "meaning": "意思是原因和结果相互联系，相互转化。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 344,
    "word": "互剥痛疮",
    "meaning": "意思是比喻互揭隐私．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 345,
    "word": "相辅相成",
    "meaning": "意思是指两件事物互相配合，互相补充，缺一不可。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 346,
    "word": "众望所归",
    "meaning": "意思是用于形容某人威望很高，受到大家敬仰和信赖。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 347,
    "word": "大海捞针",
    "meaning": "意思是在大海里捞一根针．比喻极难找到。用于比喻句中。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 348,
    "word": "自以为是",
    "meaning": "意思是总以为自己是对的认为自己的观点和做法都正确，不接受他人意见，形容主观不虚心．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 349,
    "word": "习以为常",
    "meaning": "意思是指某种事情经常去做，或某种现象经常看到也就觉得很平常了。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 350,
    "word": "不了了之",
    "meaning": "意思是用不能了结事情的办法去了结。指把未做完的事情放在一边不管，就算完事。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 351,
    "word": "充耳不闻",
    "meaning": "意思是塞住耳朵不听。形容有意不听别人的意见。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 352,
    "word": "敷衍塞责",
    "meaning": "指工作不认真负责，表面应付了事。敷衍：马虎，不认真，表面上应付；塞责：捆塞责任。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 354,
    "word": "无动于衷",
    "meaning": "意思是心里一点儿也没有触动。指对应该关心、注意的事情毫不关心置之不理含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 355,
    "word": "收效甚微",
    "meaning": "指付出的努力基本没什么效果。收效，成果。甚，很．微，少。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 356,
    "word": "粗制滥造",
    "meaning": "意思是写文章或做东西马虎草率，只求数量，不顾质量。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 357,
    "word": "得心应手",
    "meaning": "意思是心手相应运用自如，多形容技艺纯熟。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 358,
    "word": "以偏概全",
    "meaning": "用片面的观点看待整体问题片面地根据局部现象来推论整体，得出错误的结论。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 359,
    "word": "绰绰有余",
    "meaning": "形容房屋或钱财非常宽裕，用不完．绰绰：宽裕的样子．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 360,
    "word": "望文生义",
    "meaning": "意思是指不了解某一词句的确切涵义或来源缘由，光从字面上去牵强附会，做出不确切的解释．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 361,
    "word": "游刃有余",
    "meaning": "意思是刀刃运转于骨节空隙中，有回旋的余地，比喻技术熟练，经验丰富，解决问题丝毫不费力。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 362,
    "word": "金科玉律",
    "meaning": "原形容法令条文的尽善尽美。现比喻必须遵守、不能变更的信条。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 363,
    "word": "天经地义",
    "meaning": "指天地间历久不变的常道。指理所当然，不容置疑的问题。也指理所当然的事。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 364,
    "word": "不易之论",
    "meaning": "意思是不可更改的言论，形容论断或意见非常正确。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 365,
    "word": "日异月殊",
    "meaning": "每天每月都有差异。形容变化大。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 366,
    "word": "五颜六色",
    "meaning": "形容色彩复杂或花样繁多．引申为各色各样。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 367,
    "word": "天造地设",
    "meaning": "意思是事物自然形成，合乎理想，不必再加工．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 368,
    "word": "万紫千红",
    "meaning": "形容百花齐放，色彩艳丽；多指繁盛的春色，也比喻事物丰富多彩。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 369,
    "word": "姥紫嫣红",
    "meaning": "形容各种花朵娇艳美丽。女宅：美丽，嫣：美好，常指笑容。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 370,
    "word": "高歌猛进",
    "meaning": "意思是高声歌唱，勇猛前进；形容在前进的道路上，充满乐观精神。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 372,
    "word": "今非昔比",
    "meaning": "是指现在不是过去能比得上的多指形势、自然面貌等发生了巨大的变化。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 373,
    "word": "革故鼎新",
    "meaning": "意思是指除去旧的，建立新的．革：改变革除，故：旧的鼎：树立．含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 374,
    "word": "赫一时",
    "meaning": "意思是指在一个时期内名声威势很盛。贬义词。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 375,
    "word": "电光火石",
    "meaning": "意思是闪电的光，燧石的火，原为佛家语，比喻事物瞬息即逝，现多形容事物像闪电和石火一样一瞬间就消失。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 376,
    "word": "杳无音讯",
    "meaning": "意思是指没有一点消息，形容信息断绝，了解不到对方的情况．杳：不见踪迹．音讯：消息，回信。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 377,
    "word": "无影无踪",
    "meaning": "没有一点踪影。形容完全消失，不知去向。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 378,
    "word": "销声匿迹",
    "meaning": "不再公开讲话，不再出头露面，形容隐藏起来不出声不露面。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 379,
    "word": "病入膏育",
    "meaning": "意思是病情特别严重，无法医治，也比喻事态严重到不可挽回的地步。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 380,
    "word": "动荡不安",
    "meaning": "意思是动荡摇摆，不安定；形容局势不稳定，不平静。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 381,
    "word": "阴差阳错",
    "meaning": "意思是比喻由于偶然的因素而造成了差错。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 383,
    "word": "不期而遇",
    "meaning": "意思是没有约定而遇见。指意外碰见。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 384,
    "word": "了无生机",
    "meaning": "一点生命的活力都没有奄奄一息的样子．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 385,
    "word": "机缘巧合",
    "meaning": "特殊的缘分，巧妙的融合遇到，在一起。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 386,
    "word": "奄奄一息",
    "meaning": "形容气息微弱临近死亡。也比喻事物即将消亡、湮没或毁灭．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 387,
    "word": "接踵而至",
    "meaning": "意思是指人们前脚跟着后脚，接连不断地来，形容人接连而来或事情待续发生。踵：脚后跟；接踵：足跟与足尖相接。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 388,
    "word": "逢机遴会",
    "meaning": "意思是遭逢机会．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 389,
    "word": "专心致志",
    "meaning": "意思是把心思全放在上面。形容一心一意，聚精会神。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 390,
    "word": "穷经皓首",
    "meaning": "意思是直到年老头白还在钻研经书和古籍，形容勤勉好学，至老不倦",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 391,
    "word": "学而不厌",
    "meaning": "意思是学习没有满足的时候，比喻非常好学。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 392,
    "word": "镁而不舍",
    "meaning": "意思是不停地雕刻。比喻有恒心，有毅力。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 393,
    "word": "奋发图强",
    "meaning": "意思是振作精神，以求强盛．含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 394,
    "word": "一盘散沙",
    "meaning": "意思是比喻力量分散，没有组织起来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 395,
    "word": "精神振奋",
    "meaning": "意思是振作精神，奋发努力，相当的精神。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 396,
    "word": "人心涣散",
    "meaning": "意思是思想不统一．形容人心不齐。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 397,
    "word": "聚精会神",
    "meaning": "形容专心致志，注意力高度集中的样子．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 398,
    "word": "繁荣昌盛",
    "meaning": "指国家兴旺发达欣欣向荣。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 400,
    "word": "精神抖擞",
    "meaning": "形容精神振奋，饱满。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 401,
    "word": "蒸蒸日上",
    "meaning": "意为一天天地向上发展。形容发展速度快。多指生活和生意。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 402,
    "word": "分崩离析",
    "meaning": "意思是形容国家或集团四分五裂，不可收拾。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 403,
    "word": "旁若无人",
    "meaning": "意思是身旁好像没有人，形容态度傲慢，不把别人放在眼里．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 404,
    "word": "素不相识",
    "meaning": "意思是向来不认识。素：平素，向来。用千人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 405,
    "word": "熟视无睹",
    "meaning": "看惯了却像没看见一样。形容对事物漫不经心或不重视。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 406,
    "word": "置若罔闻",
    "meaning": "意思是放在一边，好像没有听见似的．指不去过问或不予关心．置：放，摆，若：好像，罔：没有闻：听见。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 407,
    "word": "不忘初心",
    "meaning": "不忘记最初的心愿。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 408,
    "word": "力争上游",
    "meaning": "意思是比喻努力争取有利形势。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 409,
    "word": "风流云散",
    "meaning": "意思是象风和云那样流动散开，比喻在一起的人分散到四而八方。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 410,
    "word": "风雨同舟",
    "meaning": "意思是指在狂风暴雨中同乘一条船，一起与风雨搏斗，比喻共同经历患难。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 411,
    "word": "如影随形",
    "meaning": "意思是指的是好像影子老是跟着身体。比喻两个事物关系密切或两个人关系密切不能分离。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 412,
    "word": "通同一气",
    "meaning": "意思是串通在一起。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 413,
    "word": "交相辉映",
    "meaning": "意指各种光亮、色彩等互相映照。多用于形容美好的景象。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 414,
    "word": "平分秋色",
    "meaning": "意思是比喻双方各得一半，不分高低，表示平局。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 415,
    "word": "一唱一和",
    "meaning": "意思是指一个先唱，一个随声应和。原形容两人感情相通，现也比喻二人互相配合，互相呼应。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 416,
    "word": "势均力敌",
    "meaning": "意思是双方力量相等不分高低",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 417,
    "word": "遥相呼应",
    "meaning": "意思是远远地互相联系，互相配合。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 418,
    "word": "风驰电掣",
    "meaning": "意思是形容非常迅速，像风吹闪电一样快。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 420,
    "word": "风风火火",
    "meaning": "意思是形容急急忙忙，冒冒失失的样子。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 421,
    "word": "风声鹤唳",
    "meaning": "形容惊慌疑惧。用于战争等。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 422,
    "word": "步履维艰",
    "meaning": "意思是指行走困难行动不方便。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 423,
    "word": "艰苦奋斗",
    "meaning": "意思是不怕艰难困苦，坚持英勇斗争。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 424,
    "word": "困难重重",
    "meaning": "一个困难接着一个困难",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 425,
    "word": "举步艰难",
    "meaning": "意思是形容已陷入十分艰难的处境。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 426,
    "word": "投机取巧",
    "meaning": "意思是用不正当的手段谋取私利。也指靠小聪明占便宜。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 427,
    "word": "以邻为壑",
    "meaning": "意思是拿邻国当做大水坑，把本国的洪水排泄到那里去．比喻只图自己一方的利益，把困难或祸害转嫁给别人。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 428,
    "word": "落井下石",
    "meaning": "意思是指看见人要掉进陷阱里，不伸手救他，反而推他下去，又扔下石头，比喻乘人有危难时加以陷害。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 429,
    "word": "寡廉鲜耻",
    "meaning": "旧指不廉洁，不知耻；现指不知羞耻．寡、鲜：少．含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 430,
    "word": "海水不可斗量",
    "meaning": "海水是不可以用斗去星的。比喻不可根据某人的现状就低估他的未来。含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 431,
    "word": "百思不得其解",
    "meaning": "意思是对事情百般思索也无法理解。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 432,
    "word": "夏虫不可语冰",
    "meaning": "意思就是一种虫子如果它生命周期只有夏天这几个月，你跟它说冰是什么东西，它是不会知道的它想象不出来那个东酉因为它的生命周期从来不经过冬天。比喻时间局限人的见识。也比喻人的见识短浅，不懂大道理。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 433,
    "word": "可望而不可即",
    "meaning": "指可以望到但无法接近。形容看似可以到达而实际上很难达到或不能接近。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 434,
    "word": "斗折蛇行",
    "meaning": "意思是像北斗星一样弯曲，像蛇一样曲折行进。形容道路曲折婉蜓。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 435,
    "word": "登高履危",
    "meaning": "意思是比喻诚惶诚恐。用千人生。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 436,
    "word": "拾级而上",
    "meaning": "意思是顺着阶梯一步一步的往上走。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 437,
    "word": "叹为观止",
    "meaning": "形容所见到的事物好到了极点。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 438,
    "word": "触目皆是",
    "meaning": "意思是眼睛所看到的地方，到处都是形容很多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 440,
    "word": "斗量车载",
    "meaning": "意思是形容数量很多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 441,
    "word": "蓬华生辉",
    "meaning": "形容贵客来访令主人感到增光不少。蓬莘：编蓬草、荆竹为门，形容穷苦人家。含褒义多用作谦词",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 443,
    "word": "纤尘不染",
    "meaning": "原指佛教徒修行时，排除物欲，保持心地洁净，现泛指丝毫不受坏习",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 444,
    "word": "刻舟求剑",
    "meaning": "一般比喻死守教条，拘泥成法，固执不变通的人。含贬义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 445,
    "word": "皮里阳秋",
    "meaning": "意思是藏在心里不说出来的言论。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 446,
    "word": "买犊还珠",
    "meaning": "指买了装了珍珠的木匣退还了珍珠；比喻取舍不当次要的东西比主要的还要好",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 447,
    "word": "孤芳自赏",
    "meaning": "指自命清高，自我欣赏的人。也指脱离群众，自以为了不起。多含贬义，也可用作褒义。",
    "color": "贬义",
    "frequency": 1
  },
  {
    "id": 448,
    "word": "一语双关",
    "meaning": "意思是一旬话包含两个意思。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 449,
    "word": "略逊一筹",
    "meaning": "意思指比较起来，稍微差一点．逊：次、差，筹：算筹．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 450,
    "word": "三言两语",
    "meaning": "意思是几旬话，形容话很少。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 451,
    "word": "寥寥数语",
    "meaning": "非常简括地说。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 453,
    "word": "唾手可得",
    "meaning": "指动手就可以取得，比喻极容易得到．含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 455,
    "word": "一脉相通",
    "meaning": "意思是指事物之间相互关联，犹如一条脉络贯穿下来可以互通。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 456,
    "word": "相差无几",
    "meaning": "意思是彼此没有多大差别。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 457,
    "word": "衣钵相传",
    "meaning": "意思是中国禅宗初祖至五祖师徒间传授道法，常付衣钵为信，故称。亦泛指一般师徒间学艺上的继承。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 458,
    "word": "孜孜以求",
    "meaning": "意思是不知疲倦地探求．孜孜：勤勉的样子．含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 459,
    "word": "迷惑不解",
    "meaning": "意思是对某一事物怀疑迷惑，认识不清。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 460,
    "word": "朝思暮想",
    "meaning": "意思是早晚都想念。形容非常想念或经常想着某一件事。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 461,
    "word": "潜精研思",
    "meaning": "意思为专心钻研．用于学术等",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 462,
    "word": "浅尝辄止",
    "meaning": "意思是略微尝试一下就停下来。指不深入钻研。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 463,
    "word": "应运而生",
    "meaning": "旧指应天命而产生。现指适应时机而产生。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 464,
    "word": "蔚为大观",
    "meaning": "形容丰富多彩的景色，雄伟的景象。形容事物美好而繁多，给人一种盛大的印象。多指文物、盛大的景象等。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 465,
    "word": "笫门圭窦",
    "meaning": "意思是形容住室极其简陋，旧指穷人住处．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 468,
    "word": "粉墙黛瓦",
    "meaning": "指雪白的墙壁，青黑的瓦，用来描写房屋。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 469,
    "word": "一丝一缕",
    "meaning": "一根丝一根线．中形容微小的东西。＠借指衣服．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 470,
    "word": "钟鸣鼎食",
    "meaning": "击钟列鼎而食，形容贵族的豪华排场。钟：古代乐器，鼎古代炊器。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 471,
    "word": "曲径通幽",
    "meaning": "意思是弯曲的小路通到风景美丽的地方。形容景色雅致迷人．含褒义。",
    "color": "褒义",
    "frequency": 1
  },
  {
    "id": 472,
    "word": "桑枢瓮牖",
    "meaning": "意思是用桑树做门轴，用瓦罐做窗户，比喻贫苦之家。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 473,
    "word": "枝繁叶茂",
    "meaning": "形容枝叶繁盛茂密，或比喻家族人丁兴旺，后代子孙多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 474,
    "word": "繁花似锦",
    "meaning": "意思是许多色彩纷繁的鲜花，好像富丽多彩的锦缎。形容美好的景色和美好的事物。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 475,
    "word": "春色满园",
    "meaning": "意思是整个园子里一片春天的景色。比喻到处是欣欣向荣的景象。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 477,
    "word": "珠联璧合",
    "meaning": "璧：平圆形中间有孔的玉。珍珠联串在一起，美玉结合在一块。比喻杰出的人才或美好的事物结合在一起。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 478,
    "word": "行之有效",
    "meaning": "指某种方法或措施已经实行过证明很有效用。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 480,
    "word": "匪夷所思",
    "meaning": "不是根据常理所能想象到的．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 481,
    "word": "力所能及",
    "meaning": "自己的能力所能办到的．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 483,
    "word": "啼笑皆非",
    "meaning": "哭也不是，笑也不是。形容既令人难受，又让人觉得可笑。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 484,
    "word": "沙里淘金",
    "meaning": "海用水冲洗，滤除杂质。从沙里淘出黄金．比喻好东西不易得。也比喻做事费力大而收效少。也比喻从大呈的材料里选择精华。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 485,
    "word": "百里挑一",
    "meaning": "形容十分出众。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 486,
    "word": "迫不得已",
    "meaning": "迫千无奈，不由得不那样（做）",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 487,
    "word": "始料未及",
    "meaning": "没有想到的在意料之外的。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 488,
    "word": "缺一不可",
    "meaning": "少一样也不行。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 491,
    "word": "博大精深",
    "meaning": "（思想、学说等）广博高深。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 492,
    "word": "鹤立鸡群",
    "meaning": "形容一个人的仪表或本领出众。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 493,
    "word": "门可罗雀",
    "meaning": "形容门庭冷落，没有什么人来往。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 494,
    "word": "冷嘲热讽",
    "meaning": "尖刻、辛辣的嘲笑和讽刺。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 495,
    "word": "寡不敌众",
    "meaning": "人少的一方抵挡不住人多的一方。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 496,
    "word": "疾言厉色",
    "meaning": "言语急促，神色严厉。形容对人发怒时说话的神情。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 497,
    "word": "势单力薄",
    "meaning": "指力量不足。声名鹊起",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 498,
    "word": "相得益彰",
    "meaning": "两者互相配合或映衬，双方的长处和作用更能显示出来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 499,
    "word": "门庭若市",
    "meaning": "门前和院子里像集市一样。形容往来人很多，十分热闹。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 500,
    "word": "相濡以沫泉水千",
    "meaning": "，鱼靠在一起以唾沫相互湿润",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 501,
    "word": "广为人知",
    "meaning": "流传很广，大家都知道。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 502,
    "word": "相视莫逆",
    "meaning": "莫逆：彼此情投意合，非常相好。形容彼此间友谊深厚，无所违逆于心．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 503,
    "word": "势在必行",
    "meaning": "指某事根据事物的发展趋势必须做。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 504,
    "word": "势如累卵",
    "meaning": "形容事态非常危险。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 505,
    "word": "望尘莫及",
    "meaning": "远远望着前而人马行走时扬起来的尘土而追赶不上。比喻远远落在后面。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 506,
    "word": "迎刃而解",
    "meaning": "比喻主要问题解决了，其他有关的问题就很容易解决。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 507,
    "word": "鞭长莫及",
    "meaning": "原来是说虽然鞭子长，但是不应该打到马肚子上，后来借指力量达不到。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 508,
    "word": "无能为力",
    "meaning": "用不上力量。指没有能力去做或力量达不到。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 509,
    "word": "孜孜不倦孜孜",
    "meaning": "勤勉，不懈怠．指工作或学习勤奋不知疲倦。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 510,
    "word": "精益求精",
    "meaning": "（学术、技术、作品、产品等）好了还求更好。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 511,
    "word": "字斟句酌",
    "meaning": "对每一字、每一句都仔细推敲，形容说话或写作的态度慎重。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 512,
    "word": "特立独行",
    "meaning": "指有操守、有见识，不随波逐流。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 513,
    "word": "针锋相对",
    "meaning": "针尖对针尖．比喻双方意见、观点等尖锐对立．也比喻在斗争中对准对方的言论行动采取相应的有力措施。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 514,
    "word": "同日而语",
    "meaning": "放在同一时间谈论，指相提并论（多用于否定式）．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 515,
    "word": "一目了然",
    "meaning": "一眼就能看得清清楚楚。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 516,
    "word": "惊世骇俗",
    "meaning": "因言行异千寻常而使人震惊。也说惊世震俗。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 517,
    "word": "望其项背",
    "meaning": "能够望见别人的颈项和背脊，表示赶得上或比得上（多用于否定式）：难以～。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 518,
    "word": "板上钉钉",
    "meaning": "比喻事情已定，不能变更．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 519,
    "word": "坚不可摧",
    "meaning": "非常坚固，摧毁不了．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 520,
    "word": "翘首以待",
    "meaning": "形容殷切盼望。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 521,
    "word": "雷打不动",
    "meaning": "形容坚定，不可动摇：他每天早展坚持跑步，  ～。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 522,
    "word": "茅塞顿开",
    "meaning": "被堵塞的心忽然被打开了．形容受到启发，一下子理解领会了道理。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 523,
    "word": "如梦初醒",
    "meaning": "好像刚从梦中醒过来，比喻从糊涂、错误的境地中刚刚醒悟过来。524、独领风骚：形容超群出众，没有谁可与之相比。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 525,
    "word": "一往无前",
    "meaning": "指不把前进道路上的困难放在眼里，无所畏惧、毫不动摇地奋勇前进。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 527,
    "word": "大势所趋",
    "meaning": "整个形势发展的趋向",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 528,
    "word": "迎来送往",
    "meaning": "走的欢送，来的欢迎。形容忙千交际应酬．蒸蒸日上",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 529,
    "word": "生机勃勃",
    "meaning": "形容自然界充满生命力，或社会生活活跃。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 530,
    "word": "日渐式微",
    "meaning": "事物逐渐地由兴盛而衰落。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 531,
    "word": "江河日下",
    "meaning": "江河的水天天向下流。比喻情况一天一天地坏下去。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 533,
    "word": "力不从心",
    "meaning": "心里想做，但力量或能力办不到。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 534,
    "word": "上行下效",
    "meaning": "上面或上辈的人怎样做，下面或下辈的人就学着怎样做（多指不好的事）。从善如流",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 535,
    "word": "高山仰止",
    "meaning": "高山：比喻高尚的品德。比喻对高尚的品德的仰慕。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 537,
    "word": "转瞬即逝",
    "meaning": "形容很快就会失去或消失。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 538,
    "word": "千变万化",
    "meaning": "形容变化极多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 540,
    "word": "先入为主",
    "meaning": "先看到一种情况或先听了一种意见，形成成见，后来就不再考虑情况变化或听取另外的意见。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 541,
    "word": "无所适从",
    "meaning": "不知跟从哪一个好。比喻不知怎么办才好。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 543,
    "word": "朝令夕改",
    "meaning": "也说朝令暮改。早晨发布的命令，晚上就改变．后比喻经常改变主张和办法，使人无所适从。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 544,
    "word": "洁身自好",
    "meaning": "指保持自身纯洁，不同流合污．也指怕招惹是非，只关心自己不关心公众事情。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 545,
    "word": "洗心革面",
    "meaning": "清除坏思想，改变旧面貌。比喻彻底改过自新。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 546,
    "word": "严千律己",
    "meaning": "律：约束。严格地约束自己。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 547,
    "word": "一去不返",
    "meaning": "一去就不再回来了．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 548,
    "word": "无所不在",
    "meaning": "到处都存在，到处都有",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 549,
    "word": "目不窥园",
    "meaning": "后用以形容埋头读书专心治学。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 551,
    "word": "铺天盖地",
    "meaning": "形容声势大来势猛，到处都是",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 553,
    "word": "皓首穷经",
    "meaning": "皓：白，首：头发，穷经：专心研究经书和古籍。一直到年老头白之时还在深入钻研经书和古籍。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 554,
    "word": "杯水风波",
    "meaning": "字面解读就是一杯水所引起的风波表示小题大做。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 555,
    "word": "瓜田李下",
    "meaning": "经过瓜田，不弯下身来提鞋，免得人家怀疑摘瓜，走过李树下面，不举起手来整理帽子，免得人家怀疑摘李子．后用“瓜田李下“比喻容易引起赚疑的地方。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 556,
    "word": "一叶知秋",
    "meaning": "看见一片落叶，就知道秋天将要来了．比喻从事物的某些细微迹象就预料到事物的发展趋向和变化。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 557,
    "word": "并驾齐驱",
    "meaning": "几匹马并排拉一辆车，一齐快跑。比喻齐头并进。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 558,
    "word": "并行不悖",
    "meaning": "同时进行，不相冲突。相向而行",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 559,
    "word": "鳞次种比",
    "meaning": "像鱼鳞和梳子的齿一样，一个挨着一个地排列着，多用来形容房屋等密集。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 560,
    "word": "星罗棋布",
    "meaning": "像天上的星星和棋盘上的棋子一样散布着。形容数量多，分布广。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 562,
    "word": "变化莫测",
    "meaning": "测：估测。变化很多，不能预料。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 564,
    "word": "民不聊生",
    "meaning": "老百姓无以为生，没有办法生活下去。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 565,
    "word": "流离失所",
    "meaning": "由于灾荒战乱等而流转离散在外，失掉安身的地方。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 566,
    "word": "背井离乡",
    "meaning": "也说离乡背井。离开自己的故乡，到外地生活（多指在不得己的情况下）．饥寒交迫",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 567,
    "word": "雅俗共赏",
    "meaning": "形容某些文艺作品既优美，又通俗，各种文化程度的人都能够欣赏。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 568,
    "word": "风靡一时",
    "meaning": "风靡草木随风倒下，引伸为很风行．形容事物在一个时期里极其盛行，像风吹倒草木一样。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 570,
    "word": "美不胜收",
    "meaning": "胜：尽。美好的东西很多，一时看不过来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 571,
    "word": "反客为主",
    "meaning": "意思是客人反过来成为主人。比喻变被动为主动。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 572,
    "word": "以一持万",
    "meaning": "意思是形容抓住关键，可以控制全局。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 573,
    "word": "主客颠倒",
    "meaning": "意思是比喻事物轻重大小颠倒了位置。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 574,
    "word": "舍本逐末",
    "meaning": "比喻做事不注意根本，而只抓细微末节．抛弃事物根本、主要的部分，而去追求枝节、次要的部分。比喻做事不抓住主要的问题，而专顾细枝末节。多用千指轻重主次颠倒不会明辨轻重缓急。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 575,
    "word": "喧宾夺主",
    "meaning": "指客人的声音压倒了主人的声音．比喻外来的或次要的事物占据了原有的或主要的事物的位置。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 576,
    "word": "本末倒置",
    "meaning": "本：树根；末：树梢置：放。意思是比喻把主要的和次要的、本质和非本质的关系弄颠倒了。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 577,
    "word": "太阿倒待",
    "meaning": "意思是把太阿宝剑倒着拿，比喻以把柄授与人，自身反而面临危险或灾害。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 578,
    "word": "轻重倒置",
    "meaning": "意思是把重要的和不重要的两者的地位摆颠倒了．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 579,
    "word": "千金难求",
    "meaning": "本意是花一千两黄金也弄不来，比喻有钱但是买不到。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 580,
    "word": "不可多得",
    "meaning": "意思是形容非常稀少，很难得到。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 582,
    "word": "鼓舞人心",
    "meaning": "意思是振奋人们的信心，增强人们的勇气。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 583,
    "word": "不言自明",
    "meaning": "指不用说话就能明白，形容道理很明显，容易理解。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 584,
    "word": "心如止水",
    "meaning": "意思是指心里平静得像不动的水一样。形容坚持信念，不受外界影响。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 585,
    "word": "指桑骂槐",
    "meaning": "意思是指着桑树数落槐树，比喻表面上骂这个人，实际上骂那个人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 587,
    "word": "仅此而已",
    "meaning": "意思是只是这样罢了。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 588,
    "word": "如是而已",
    "meaning": "如是：像这样，而已：罢了．就是这样罢了．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 589,
    "word": "严阵以待",
    "meaning": "摆好严整的阵势等待着要来犯的敌人，形容做好完全的准备工作。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 591,
    "word": "严防死守",
    "meaning": "严密防护，坚决死守表示非常坚定守住。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 592,
    "word": "去芜存菁",
    "meaning": "意思是除去杂质、保留精华。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 593,
    "word": "弃旧图新",
    "meaning": "意思是抛弃旧的，谋求新的．多指由坏的转向好的，离开错误的道路走向正确的道路．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 594,
    "word": "拨乱反正",
    "meaning": "意思是消除混乱局面，恢复正常秩序。扭转乱象，归于正道。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 595,
    "word": "不可名状",
    "meaning": "无法用语言来形容。名：说出。状：描述。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 596,
    "word": "不可抗拒",
    "meaning": "指不可以违抗某个人的话或指令，要按照他的意思去做。指不能避免的自然灾害等。指没有可能，没办法拒绝。任何力量都无法阻。一般而言，我们在日常生活中遇到的不可抗据现象通常包括：暴雨、地震、泥石流、台风、战争、内乱等不以人的主观意志为转移而发生的事件。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 597,
    "word": "不遗余力",
    "meaning": "意思是把所有力量毫无保留使出来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 598,
    "word": "不惜血本",
    "meaning": "意思是为了达到目的不吝惜所花费的代价。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 599,
    "word": "无以复加",
    "meaning": "意思是不可能再增加，指某事在程度上达到了极点。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 600,
    "word": "千难万险",
    "meaning": "意思是形容困难和危险极多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 601,
    "word": "刚悛自用",
    "meaning": "意思是十分固执自信，不考虑别人的意见。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 602,
    "word": "剑走偏锋",
    "meaning": "一指不走常规，找一些新的、不同以往的办法来解决问题，以求出奇制胜；二指剑法评述语．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 603,
    "word": "泥古不化",
    "meaning": "比喻拘泥千古代的成规或古人的说法而不知变通。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 604,
    "word": "恃才放旷",
    "meaning": "意思是倚仗着自己的才能而对自己的行为不加以约束。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 605,
    "word": "无可辩驳",
    "meaning": "意思是没有理由或根据来否定对方的意见。形容事实确凿，理由充足。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 606,
    "word": "饮恨败北",
    "meaning": "饮恨指的是抱恨，抱憾败北即战败饮恨败北即是含恨失败的意思。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 607,
    "word": "实至名归",
    "meaning": "意思是有了真正的学识、本领或功业，自然就有声誉。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 608,
    "word": "擦肩而过",
    "meaning": "挨着肩而溜走。指没有抓住机会。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 609,
    "word": "名正言顺",
    "meaning": "原意是指名分正当说话合理。后多指做某事名义正当道理也说得通。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 610,
    "word": "抱憾终身",
    "meaning": "一辈子都感到遗憾",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 611,
    "word": "失之交臂",
    "meaning": "指擦肩而过．形容当面错过。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 612,
    "word": "精雕细刻",
    "meaning": "精心细致地雕刻。形容创作艺术品时的苦心刻画。也比喻认真细致地加工。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 613,
    "word": "一劳永逸",
    "meaning": "辛苦一次，把事情办好，以后就可以不再费力了．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 614,
    "word": "签底抽薪",
    "meaning": "把柴火从锅底抽掉．比喻从根本上解决问题。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 616,
    "word": "只争朝夕",
    "meaning": "比喻抓紧时间力争在最短的时间内达到目的。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 617,
    "word": "一步登天",
    "meaning": "比喻一下子就达到很高的境界或程度。有时也用来比喻人突然得志，爬上高位．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 618,
    "word": "刻不容缓",
    "meaning": "指形势紧迫，一刻也不允许拖延．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 619,
    "word": "独当一面",
    "meaning": "单独负责一个方面的工作。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 620,
    "word": "一夜成名",
    "meaning": "指一旦中了科举就扬名天下。后来人们用一夜成名形容人一下子就成功了。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 621,
    "word": "红口白牙",
    "meaning": "指一口咬定或指某句话确实说过。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 622,
    "word": "声名远扬",
    "meaning": "名气很大，传播到很远的地方。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 623,
    "word": "出人头地",
    "meaning": "意思是指高人一等形容德才超众或成就突出。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 624,
    "word": "一鸣惊人",
    "meaning": "鸣：鸟叫．一叫就使人震惊．比喻平时没有突出的表现，一下子做出惊人的成绩。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 625,
    "word": "声名鹊起",
    "meaning": "鹊起：如鹊飞起。声望和名誉像喜鹊一样飞起，形容名声大振。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 627,
    "word": "贻笑大方",
    "meaning": "贻笑让人笑话；大方：原指懂得大道的人，后泛指见识广博或有专长的人．指让内行人笑话。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 628,
    "word": "显而易见",
    "meaning": "意思是事情或道理很明显，极容易看清。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 630,
    "word": "目瞪口呆",
    "meaning": "形容因吃惊或害怕或激动而发愣、发傻的样子．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 633,
    "word": "追悔莫及",
    "meaning": "表示后海也来不及了，",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 634,
    "word": "尔虞我诈",
    "meaning": "尔：你，虞、诈：欺骗。表示彼此互相欺骗。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 637,
    "word": "汪洋恣肆",
    "meaning": "意思是形容文章、言论、书法等气势豪放，潇洒自如。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 638,
    "word": "戎马佼惚",
    "meaning": "意思是形容军务繁忙。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 639,
    "word": "纵横抻阖",
    "meaning": "意思是指在政治、外交上运用手段进行联合或分化。纵横：用游说来联合；裨阖：开合。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 641,
    "word": "欣喜若狂",
    "meaning": "意思是形容高兴、兴奋到了极点。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 642,
    "word": "情有独钟",
    "meaning": "因对某人或某事物特别喜爱而感情专注。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 643,
    "word": "欢呼雀跃",
    "meaning": "高兴得像麻雀一样跳跃。形容非常欢乐。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 644,
    "word": "如痴如狂",
    "meaning": "形容神态失常，不能自制。亦指为某人某事所倾倒。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 645,
    "word": "推心置腹",
    "meaning": "推出自己的赤心，放置在别人的腹中。表示把自己内心的想法毫无保留地告诉对方．比喻真诚待人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 646,
    "word": "开诚布公",
    "meaning": "以诚意相见，坦率无私地表示意见。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 647,
    "word": "毫不犹豫毫",
    "meaning": "一点儿，犹豫迟疑，拿不定主意。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 648,
    "word": "光明磊落",
    "meaning": "形容没有私心，胸怀坦白。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 649,
    "word": "自命清高",
    "meaning": "命：认为。自以自为清高。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 650,
    "word": "小题大做",
    "meaning": "比喻把小事当做大事来办，有不值得这样做或有意扩大事态的意思。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 651,
    "word": "活灵活现",
    "meaning": "也说活龙活现。形容描绘生动，神情逼真，使人有亲眼所见的感觉。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 652,
    "word": "栩栩如生",
    "meaning": "形容艺术形象非常生动逼真，像活的一样。2",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 653,
    "word": "妮妮动听",
    "meaning": "话说得婉转生动，使人喜欢听。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 654,
    "word": "绘声绘色",
    "meaning": "形容叙述、描写生动逼真．也说绘影绘声、绘声绘影。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 655,
    "word": "惟妙惟肖",
    "meaning": "形容描写或模仿得非常好，非常逼真。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 656,
    "word": "盛气凌人",
    "meaning": "傲慢的气势逼人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 657,
    "word": "吹毛求疵",
    "meaning": "把皮上的毛吹开，寻找疵点。比喻故意挑毛病找错。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 658,
    "word": "喷喷叨叨",
    "meaning": "说话   嗦，一说起来没个完。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 659,
    "word": "居高临下",
    "meaning": "占据高处，面向低处。形容所居位置可以控制全局、极为有利。660、回天乏术：回天：比喻力量大，能移转极难挽回的时势；乏术：缺少方法。比喻局",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 661,
    "word": "孤立无援",
    "meaning": "只有一个人或一方面的力量，得不到外力援助。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 662,
    "word": "力所不逮",
    "meaning": "指能力达不到。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 663,
    "word": "具体而微",
    "meaning": "形容事物的内容大体具备，不过规模形状要小一些。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 664,
    "word": "一丝不苟",
    "meaning": "形容做事十分认真、细致，一点儿也不马虎．苟：苟且，马虎。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 665,
    "word": "返观内视",
    "meaning": "原为佛教语．指用佛性对照检查．后亦指自我反省。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 666,
    "word": "事倍功半",
    "meaning": "形容花费的气力大，收到的成效小．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 669,
    "word": "适得其反",
    "meaning": "结果跟希望正好相反。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 670,
    "word": "耳濡目染",
    "meaning": "经常听到看到不知不觉地受到影响。濡：沾湿．染：沾染。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 672,
    "word": "润物无声",
    "meaning": "指有大胸怀者，做了贡献而不张扬，默默奉献。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 673,
    "word": "一呼百应",
    "meaning": "一声召唤，群起响应。形容威信高，响应者多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 674,
    "word": "不令而行",
    "meaning": "不须命令而在下者自会正直。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 675,
    "word": "荒诞不经",
    "meaning": "意思是少有的，典籍中也没有的（事）形容不合常理。形容虚妄离奇，不合情理。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 676,
    "word": "无理取闹",
    "meaning": "原指蛙鸣相和无缘无故的喧闹，现指毫无理由地吵闹，故意吵闹、捣乱。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 677,
    "word": "比肩同行",
    "meaning": "并肩一同行走。比肩是指并肩；同行是指一同行走的意思；因此可以理解为并肩一同行走，可比喻在生活中共同进退，同甘共苦。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 678,
    "word": "等量齐观",
    "meaning": "指对有差别的事物，同等看待。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 679,
    "word": "记忆犹新",
    "meaning": "过去的事，至今印象还非常清晰，如刚发生过的一样。犹：还。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 680,
    "word": "惊叹不已",
    "meaning": "满口赞赏和赞叹。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 681,
    "word": "咄",
    "meaning": "逼人：气势汹汹，使人惊惧。也指形势发展迅速，给人压力．指后人超过前人，意思与“后生可畏”相同。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 682,
    "word": "心有余悸",
    "meaning": "指危险的事情虽然过去了，回想起来还感到害怕。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 683,
    "word": "因喳废食",
    "meaning": "原意是指因为有人吃饭喳死了，就想让天下人都不吃饭。比喻要做的事情由于出了点小毛病或怕出问题就索性不去干。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 684,
    "word": "半途而废",
    "meaning": "意思是半路上就停下来了，比喻做事不能坚持到底，有始无终。685、放任自流：意思是听凭自然的发展，不加领导或过问",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 686,
    "word": "作壁上观",
    "meaning": "原指双方交战，自己站在壁垒上旁观．后多比喻站在一旁看着，不动手帮助。顺理成章：意思是写文章、做事情顺着条理就能做好。比喻随着某种情况的发展而自然产生的结果。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 687,
    "word": "饮鸠止渴",
    "meaning": "比喻用错误的办法来解决眼前的困难而不顾严重后果．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 688,
    "word": "水到渠成",
    "meaning": "意思是指水流到之处便有渠道，比喻有条件之后，事情自然会成功，即功到自然成。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 689,
    "word": "临渴掘井",
    "meaning": "意思是比喻平时没有准备，事到临头才想办法。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 690,
    "word": "顺其自然",
    "meaning": "意思是顺着事物本来的性质自然发展。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 692,
    "word": "井井有条",
    "meaning": "意思是形容说话办事有条有理。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 694,
    "word": "善恶莫辨",
    "meaning": "对好的和不好的不能准确的分辨。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 696,
    "word": "不置可否",
    "meaning": "不明确表态，既不说对，也不说不对。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 697,
    "word": "自食其力",
    "meaning": "依赖自己的劳动来维持生活。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 698,
    "word": "自力更生",
    "meaning": "依靠自己的力量改变原来的情况而发展兴旺起来。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 699,
    "word": "自强不息",
    "meaning": "指自己不懈地努力向上。息：停止。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 700,
    "word": "自给自足",
    "meaning": "给：供给。依靠自己的生产，满足自己的需要。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 701,
    "word": "眼花缭乱",
    "meaning": "眼睛看见复杂纷繁的东西而感到迷乱。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 702,
    "word": "嘘不已",
    "meaning": "伤心地哭泣难以自止。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 703,
    "word": "大开眼界",
    "meaning": "开阔视野，增回见识。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 704,
    "word": "异想天开",
    "meaning": "比喻荒唐离奇，想象着暂时无法实现的事，还比喻超强的想象力。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 705,
    "word": "自圆其说",
    "meaning": "意思是指使自己的说法前后一致，没有自相矛盾的地方。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 706,
    "word": "沸沸扬扬",
    "meaning": "像水沸腾后气泡、热气蒸腾翻滚一样，形容人声喧扰，议论纷纷。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 707,
    "word": "不可开交",
    "meaning": "形容没法解开或无法摆脱。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 708,
    "word": "不容置喙",
    "meaning": "意思是指不允许别人插嘴说话。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 709,
    "word": "乐见其成",
    "meaning": "指希望看到某事物发展下去或取得成功。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 710,
    "word": "大有可为",
    "meaning": "比喻指前途极有希望，值得去做。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 711,
    "word": "前程似锦",
    "meaning": "意思是前程像锦绣那样，形容前途十分美好。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 712,
    "word": "圆固吞枣",
    "meaning": "意思是把枣儿整个吞下去，比喻读书等不加分析地笼统接受。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 713,
    "word": "渐入佳境",
    "meaning": "意思是比喻境况逐渐好转或风景、情趣等逐渐深入而达到美妙的境地。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 714,
    "word": "各有怀抱",
    "meaning": "另外一种心情。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 715,
    "word": "各自为政",
    "meaning": "意思是各自按自己的主张办事，不互相配合。比喻不考虑全局各搞一套。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 716,
    "word": "泛滥成灾",
    "meaning": "意思是江河湖泊的水溢出，造成灾害比喻一件事物，多到了影响正常生活的情况。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 717,
    "word": "甚嚣尘上",
    "meaning": "原意是形容军中忙于备战的状态。后比喻消息到处流传，议论纷纷。今多用来形容某种传闻或谬论十分嚣张。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 718,
    "word": "沸反盈天",
    "meaning": "意思是声音像水开锅一样沸腾翻滚，充满了空间。形容人声喧闹。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 719,
    "word": "快马加鞭",
    "meaning": "意思是跑得很快的马再加上一鞭子，使马跑得更快。比喻快上加快，加速前进。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 720,
    "word": "所剩无几",
    "meaning": "意思是剩下的没有多少了。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 721,
    "word": "不一而足",
    "meaning": "指同类的事物不止一个而是很多，无法列举齐全。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 722,
    "word": "参差向背",
    "meaning": "指不整齐，公众号樱有尽有。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 723,
    "word": "高低错落",
    "meaning": "意思是形容事物的布局虽然参差不齐，但却极有情趣，使人看了有好感。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 724,
    "word": "宝刀未老",
    "meaning": "形容人到老年还依然威猛，不减当年。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 725,
    "word": "永葆青春",
    "meaning": "指长久的保待年轻。永葆，永远保持。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 726,
    "word": "巨细无遗",
    "meaning": "意思是指大小都没有遗洲。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 727,
    "word": "不着边际",
    "meaning": "意思是挨不着边儿。多指说话空泛，不接触实际。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 728,
    "word": "神经错乱",
    "meaning": "意思是精神病；精神和思虑迷糊不清，失去常态。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 729,
    "word": "广袤无边",
    "meaning": "形容广阔得望不到边际，辽阔无边。比喻非常广阔。广：东西的长度。袤：南北的长度。恩边际；边界。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 730,
    "word": "不知所措",
    "meaning": "不知道怎么办才好。形容面对突然情况，无法应付。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 732,
    "word": "肝肠寸断",
    "meaning": "形容极度悲痛伤心．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 733,
    "word": "灰心丧气",
    "meaning": "灰心：心如熄灭了的死灰；丧失去．形容因失败或不顺利而失去信心，意志消沉。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 734,
    "word": "伤心欲绝",
    "meaning": "指极度悲哀，万分伤心得样子．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 735,
    "word": "莫此为甚",
    "meaning": "没有什么能够超过这个的了．甚超过胜过。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 736,
    "word": "大展拳脚",
    "meaning": "放开手脚大干一场．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 737,
    "word": "大马金刀",
    "meaning": "意思是形容豪爽，气派大．形容说话直率锋利不留情面。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 738,
    "word": "未定之天",
    "meaning": "意思是比喻事情还没有着落或还没有决定。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 739,
    "word": "大有可观",
    "meaning": "意思指很值得看，很值得重视。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 740,
    "word": "大有作为",
    "meaning": "能充分发挥作用；能作出重大贡献。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 741,
    "word": "自生自灭",
    "meaning": "意思是自然地发生，生长，又自然地消灭；形容自然发展，无人过问。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 742,
    "word": "自取灭亡",
    "meaning": "意思是所作所为把自己引上绝路。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 743,
    "word": "自求多福",
    "meaning": "意思是指求助自己比求助他人会得到更多的幸福。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 744,
    "word": "目无全牛",
    "meaning": "意思是眼中没有完整的牛，只有牛的筋骨结构。形容人的技艺高超，得心应手，已经到达非常纯熟的地步。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 746,
    "word": "不谋而同",
    "meaning": "解释为事先没有商量过意见或行动却完全一致。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 747,
    "word": "不爽毫厘",
    "meaning": "意思是形容一点不差。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 748,
    "word": "成风化人",
    "meaning": "成风就是倡树一种社会风气。化人，就是感染人、影响人、教育人。总体意思就是通过倡导树立一种社会风气来影响、教育感化社会大众。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 749,
    "word": "外强中干",
    "meaning": "意思是外有强形，内中千竭；泛指外表强大，内实空虚。出自",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 751,
    "word": "入不敷出",
    "meaning": "意思是指收入不够开支，形容非常贫穷。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 752,
    "word": "脚踝不前",
    "meaning": "迟疑不决，不敢前进。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 753,
    "word": "若隐若现",
    "meaning": "意思是隐隐约约，看不清楚，很难分清。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 754,
    "word": "优柔寡断",
    "meaning": "犹疑，不果断。优柔犹豫不决。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 757,
    "word": "沧海桑田",
    "meaning": "葛洪在《神仙传》里记载有一个叫麻姑的仙女，说自从她当仙女以来，已经见到东海有三次变为桑田了．后用比喻世事变化很大。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 758,
    "word": "金颐无缺",
    "meaning": "金质盛酒器，比喻国土。金     没有残缺。比喻国土完整。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 759,
    "word": "完壁归赵",
    "meaning": "意思本指简相如将完美无瑕的和氏璧，完好地从秦国带回赵国，后比喻把物品完好地归还给物品的主人。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 760,
    "word": "白云苍狗",
    "meaning": "意思是天上的浮云的形状像白衣裳顷刻又变得像灰色的狗，比喻世事变幻无常。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 762,
    "word": "严丝合缝",
    "meaning": "意思是指缝隙严密闭合。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 763,
    "word": "迥然不同",
    "meaning": "意思是形容差别很大，一点儿也不相同",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 764,
    "word": "天差地别",
    "meaning": "形容两种或多种事物之间的差距很大，就像天和地之间的距离一样。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 765,
    "word": "积厚流光",
    "meaning": "意思是积累的功业越深厚，则流传给后人的恩德越广。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 766,
    "word": "殊途同归",
    "meaning": "指的是通过不同的途径，到达同一个目的地。比喻采取不同的方法而得到相同的结果。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 767,
    "word": "数以百计",
    "meaning": "数量以百来计算，表示数量多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 768,
    "word": "不可胜数",
    "meaning": "意思是不能计算数目，形容非常多。胜：尽。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 769,
    "word": "引人入胜",
    "meaning": "引人进入美妙的境地．后多指山水风景或文学艺术等特别吸引人．胜：胜地，胜境。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 770,
    "word": "如履薄冰",
    "meaning": "履：践、踩在上面。像走在薄冰上一样。比喻行事极为谨慎，存有戒心．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 771,
    "word": "所向披靡",
    "meaning": "比喻力堂（多指军事力凿）所达到的地方，一切障碍全被扫除．披靡：草木被吹倒。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 772,
    "word": "进退维谷",
    "meaning": "进退都陷千困难的境地。形容进退两难．维：是．谷：穷尽，比喻困",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 773,
    "word": "如临深渊",
    "meaning": "临靠近；渊：深水坑。如同处于深渊边缘一般。比喻存有戒心，行事极为谨慎。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 774,
    "word": "激流勇进",
    "meaning": "意思为在急流中要勇千前进。形容在险境中积极进取，不退缩。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 775,
    "word": "骑虎难下",
    "meaning": "意思是骑在老虎背上不能下来．比喻做一件事情进行下去有困难，但情况又不允许中途停止，陷于进退两难的境地。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 776,
    "word": "美轮美奂",
    "meaning": "意思是原本多形容建筑物雄伟壮观、富丽堂皇，也形容装饰、布置等美好漂亮。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 777,
    "word": "耸人听闻",
    "meaning": "指夸大或捏造事实，使人听到了感到震惊。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 778,
    "word": "不可思议",
    "meaning": "原有神秘奥妙的意思是佛教用语．现多指无法想象，难以理解。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 779,
    "word": "闭门造车",
    "meaning": "意思是关起门来造车。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 780,
    "word": "画地为牢",
    "meaning": "意思是比喻只许在指定的范围内活动。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 781,
    "word": "固步自封",
    "meaning": "意思是比喻守着老一套，不求进步。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 782,
    "word": "无懈可击",
    "meaning": "意思是没有可以被人攻击或挑剔的缝隙，形容非常严密。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 783,
    "word": "束之高阁",
    "meaning": "意思是捆起来以后放在高高的架子上，比喻放着不用、丢在一旁不管，也比喻把某事或某种主张、意见、建议等搁置起来，不予理睬和办理。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 785,
    "word": "漠然置之",
    "meaning": "意思是很冷淡地把它搁在一边．指对人或事态度冷淡，放在一边不理．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 786,
    "word": "视若拱壁",
    "meaning": "意思是指看得极其宝贵。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 788,
    "word": "能人辈出",
    "meaning": "是指有才能的人一批批地连续出现。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 789,
    "word": "扬名天下",
    "meaning": "非常有名。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 790,
    "word": "闻名遐迩",
    "meaning": "意思是形容名声很大，主要指远近闻名。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 791,
    "word": "大显身手",
    "meaning": "意思是指充分地显示出本领和才能。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 792,
    "word": "以身殉道",
    "meaning": "为追求的道义牺牲自己的性命。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 793,
    "word": "杀身成仁",
    "meaning": "原意是说为了成全仁德，可以不顾自己的生命．现指牺牲生命，以维护正义事业。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 794,
    "word": "口是心非",
    "meaning": "指嘴里说的是一套，心里想的又是一套，心口不一致。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 795,
    "word": "视死如归",
    "meaning": "意思是把死看得像回家一样平常，形容不怕牺牲。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 796,
    "word": "沉淄一气",
    "meaning": "原比喻气味相投的人连结在一起，后比喻臭味相投的人勾结在一起。沉淄，是夜间的水气，有人说是露气，也有人说是夏天半夜里上升的地气。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 797,
    "word": "舍生取义",
    "meaning": "意思是为了正义事业不怕牺牲，为历代儒家所推崇。常用于赞扬别人难",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 798,
    "word": "同流合污",
    "meaning": "原指言行与不良的习俗、世道相合。后指跟坏人一起千坏事。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 799,
    "word": "波谪云诡",
    "meaning": "意思是原形容房屋构造就像云彩、波浪一样千姿百态。后多形容事物变",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 801,
    "word": "脸炙人口",
    "meaning": "脸和炙都是美味的食品．比喻好的诗文为人们赞美和传诵．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 804,
    "word": "照猫画虎",
    "meaning": "意思是猫与虎的外形有相似之处，因以喻照样模仿而仅得其仿佛。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 805,
    "word": "精耕细作",
    "meaning": "意思是指农业上认真细致地耕作。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 806,
    "word": "因循守旧",
    "meaning": "意思是死守老一套，缺乏创新的精神。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 807,
    "word": "与时俱进",
    "meaning": "随着时代的发展而不断发展、前进．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 808,
    "word": "接踵而来",
    "meaning": "意思指人们前脚跟着后脚，接连不断地来。形容来者很多，络绎不绝。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 809,
    "word": "蜂拥而至",
    "meaning": "意思是像一窝蜂似地拥来，形容很多人乱哄哄地朝一个地方聚拢。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 810,
    "word": "亦步亦趋",
    "meaning": "比喻由于缺乏主张，以别人为准，或为了讨好，事事模仿或追随别人．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 812,
    "word": "含英咀华",
    "meaning": "口中含着花细细咀嚼．比喻读书时细细琢磨领会文章的精华。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 813,
    "word": "吉光片羽",
    "meaning": "意思是比喻残存的珍贵文物。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 814,
    "word": "独辟蹊径",
    "meaning": "单独开出一条道路。比喻独创出新风格或新方法。蹊径：山路，小路。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 815,
    "word": "毛举细故",
    "meaning": "指烦琐地列举小事情，加以责难或攻击。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 816,
    "word": "逸闻琐事",
    "meaning": "意思是世人不再知道而感兴趣的传闻和故事。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 817,
    "word": "全神贯注",
    "meaning": "意思是全部精神集中在一点上。形容注意力高度集中。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 818,
    "word": "顾此失彼",
    "meaning": "意思是顾了这个丢了那个。形容忙乱或慌张的情景。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 819,
    "word": "无忧无虑",
    "meaning": "没有一点忧愁，顾虑和担心，形容烦恼尽除、得到解脱，心情安然自得，快乐舒心．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 820,
    "word": "漏洞百出",
    "meaning": "意思是形容作文、说话或办事破绽很多。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 822,
    "word": "风沐雨",
    "meaning": "意思是大雨洗发，疾风梳头。后用以形容经常在外而奔波劳碌。种：梳头发。沐：洗头。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 823,
    "word": "交口赞誉",
    "meaning": "交：一齐，同时。交口：众口一词．表示异口同声地称赞。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 825,
    "word": "心驰神往",
    "meaning": "形容思想集中在追求和向往的事情或地方上，一心向往。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 826,
    "word": "鞠躬尽瘁",
    "meaning": "指恭敬谨慎，竭尽心力。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 827,
    "word": "如数家珍",
    "meaning": "意思是即好像在数自己家里的珍宝一样．通常用来形容某人对所讲的事情十分熟悉",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 828,
    "word": "笫路蓝缕",
    "meaning": "意思是指驾着简陋的柴车，穿着破烂的衣服去开辟山林道路。形容创业的艰苦。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 830,
    "word": "风和日丽",
    "meaning": "意思指和风习习，阳光灿烂。形容晴朗暖和的天气。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 831,
    "word": "月朗星稀",
    "meaning": "意思是皓月当空，星星稀少。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 832,
    "word": "打道回府",
    "meaning": "意思是取道回家或原路返回。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 833,
    "word": "天公作美",
    "meaning": "老天爷成全好事。感叹顺其自然的良性表现。气象方面，符合人的意愿也指事物方面，随心如意。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 834,
    "word": "冷眼旁观",
    "meaning": "意思是指用冷静或冷淡的态度从旁观看（多指可以参与而不愿意参与）。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 835,
    "word": "拭目以待",
    "meaning": "指擦亮眼睛等待着，形容殷切期望或密切关注事态的动向及结果．",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 836,
    "word": "拒之门外",
    "meaning": "意思是把人挡在门外，不让其进入，形容拒绝协商或共事。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 837,
    "word": "力有不逮",
    "meaning": "指能力达不到， 能力触及不到。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 838,
    "word": "力屈道穷",
    "meaning": "指力噩办法都已用尽 。 道： 途径， 办法。",
    "color": "中性",
    "frequency": 1
  },
  {
    "id": 839,
    "word": "寅吃卯粮",
    "meaning": "意思是形容这一年吃了下一年的粮． 寅年吃了卯年的粮食。 比喻经济困难， 入不敷出 ，  只能预先挪用眼下亏空着的财物或还没到手的收入， 不顾将来。",
    "color": "中性",
    "frequency": 1
  }
];